<details><summary>Digger run report at 2026-03-12 03:14:40 (UTC)</summary>
      <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.eks.data.tls_certificate.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5"
    }

  # module.eks.aws_eks_access_entry.admins["arn:aws:iam::659474314285:user/cknight"] will be created
  + resource "aws_eks_access_entry" "admins" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "cknight17-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::659474314285:user/cknight"
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "cknight17"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.admins["arn:aws:iam::659474314285:user/cknight"] will be created
  + resource "aws_eks_access_policy_association" "admins" {
      + associated_at = (known after apply)
      + cluster_name  = "cknight17-dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::659474314285:user/cknight"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_cluster.this will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "cknight17-dev"
        name                          = "cknight17-dev"
        tags                          = {}
      ~ version                       = "1.31" -> "1.32"
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "cluster" {
        id              = "arn:aws:iam::659474314285:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5"
        tags            = {}
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details><summary>Terraform plan validation check (dev)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


Terraform plan summary
| CHANGE |                                            RESOURCE                                             |
|--------|-------------------------------------------------------------------------------------------------|
| add    | `module.eks.aws_eks_access_entry.admins["arn:aws:iam::659474314285:user/cknight"]`              |
|        | `module.eks.aws_eks_access_policy_association.admins["arn:aws:iam::659474314285:user/cknight"]` |
| update | `module.eks.aws_eks_cluster.this`                                                               |
|        | `module.eks.aws_iam_openid_connect_provider.cluster`                                            |


</details>